app/controllers/line_items_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "line_items" ("cart_id", "created_at", "product_id", "updated_at") VALUES (?, ?, ?, ?)  [["cart_id", 1], ["created_at", Thu, 02 Feb 2017 22:09:26 UTC +00:00], ["product_id", 1], ["updated_at", Thu, 02 Feb 2017 22:09:26 UTC +00:00]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = 1  [["quantity", 2], ["updated_at", Thu, 02 Feb 2017 22:09:27 UTC +00:00]]
---
  def create
    session[:counter] = 0
    quantity = params[:quantity][:quantity].to_i
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id, quantity)

    respond_to do |format|
      if @line_item.save