app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("created_at", "description", "image_url", "nomlatin", "price", "product_line", "proprietes", "provenance", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "description" = ?, "updated_at" = ? WHERE "products"."id" = 1  [["description", "ces"], ["updated_at", Thu, 02 Feb 2017 20:11:33 UTC +00:00]]