app/controllers/store_controller.rb

  def index
    @products = Product.order(:title)
    @type1 = @products.where(:product_line =>"1")
---
SELECT "products".* FROM "products" WHERE "products"."product_line" = 1 ORDER BY "products".title ASC